intersectSurfaces(Surface!System.Runtime.CompilerServices.IsConst*,Surface!System.Runtime.CompilerServices.IsConst*,OwnerArr&lt;GCurve&gt;*,System.Boolean)
Declarations for Arr, DoubleArr, OwnerArr, and Vec3d are in StdAfx.h, which every
source file includes.
Intersect two surfaces. No information is provided on degenerate cases
(surfaces that meet at a single point of tangency, or along a curve of
tangency, etc.). If bOnlyAnalytical is true, numerically computed intersections
will be avoided.